# RbsPipeRelativeRoughnessParam Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ParameterTypeId..::..RbsPipeRelativeRoughnessParam Property
ParameterTypeId Class See Also
---
"Relative Roughness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeRelativeRoughnessParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeRelativeRoughnessParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeRelativeRoughnessParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace